{"sections":{"main":{"type":"main-page","disabled":true,"settings":{"padding_top":28,"padding_bottom":28}},"1654829481a6132a9e":{"type":"rich-text","blocks":{"16548294814f767533-0":{"type":"heading","settings":{"heading":"Frequently Asked Questions","heading_size":"h1"}},"16548294814f767533-1":{"type":"text","disabled":true,"settings":{"text":"<p>Share information about your brand with your customers. Describe a product, make announcements, or welcome customers to your store.<\/p>"}},"16548294814f767533-2":{"type":"button","disabled":true,"settings":{"button_label":"Button label","button_link":"","button_style_secondary":false}}},"block_order":["16548294814f767533-0","16548294814f767533-1","16548294814f767533-2"],"settings":{"color_scheme":"background-1","full_width":true,"padding_top":40,"padding_bottom":16}},"165482952999a06e00":{"type":"collapsible-content","blocks":{"16548295297bc05ba3-0":{"type":"collapsible_row","settings":{"heading":"This event is for the 2022 edition of Asian BP, why is it scheduled in 2023?","icon":"none","row_content":"<p>Running an in-person event of this size requires quite a fair bit of preparation time. With the bid timeline set to be finalised in mid July, it will be a logistical challenge to execute an event on such short notice. Only after winning the bid can the team set out to make payments for deposits, collect registration, book flights, and make arrangements to set up the premises. Usually bids have a full year to prepare for the event after winning the bid, so event 3-4 months is considered pretty tight.<\/p><p>That considered, an event with sufficient preparation will put us in the November\/December period if we wanted to host it this year. <\/p><p>The November\/December period is not an ideal time to host the event as flight prices are usually the highest in that period. In addition, university exams taking place towards the end of November or early December makes it all the more challenging for teams to attend.<\/p><p>Having Asian BP this year will also have it wedged between two world championships. The delayed Belgrade Worlds (Online) will take place in July while Madrid Worlds (In-Person) will take place in December. That means that financial budgets for many institutions will already have be exhausted for this calendar year and the likelyhood of supporting another in-person activity within the same semester of Madrid Worlds will be very unlikely.<\/p><p>As such, having it in January is logistically feasible for EduDrift and also helps in recalibrating the debating calendar moving forward.<\/p>","page":""}},"16548295297bc05ba3-2":{"type":"collapsible_row","settings":{"heading":"This event will take place one week after the conclusion of the World Championships in Madrid, Spain. Will that not be a problem for institutions to attend?","icon":"none","row_content":"<p>Madrid WUDC will conclude by 4 Jan, giving teams and judges a week of buffer to plan for another event.<\/p><p>On the financial end, with the event planned for 2023, many institutions will have sufficient time to apply for financial support, raise funds and gain access to budgets for 2023.<\/p><p><\/p>","page":""}},"16548295297bc05ba3-1":{"type":"collapsible_row","settings":{"heading":"Are the dates of this event fixed?","icon":"none","row_content":"<p>Yes, the event dates are fixed. It will take place one week after the World Championships, and one week before the Lunar New Year.<\/p><p>By this time, all universities would have concluded their final exams.<\/p>","page":""}},"16548295297bc05ba3-3":{"type":"collapsible_row","disabled":true,"settings":{"heading":"Collapsible row","icon":"check_mark","row_content":"","page":""}}},"block_order":["16548295297bc05ba3-0","16548295297bc05ba3-2","16548295297bc05ba3-1","16548295297bc05ba3-3"],"settings":{"caption":"","heading":"General","heading_size":"h2","heading_alignment":"left","layout":"none","color_scheme":"background-1","container_color_scheme":"background-2","open_first_collapsible_row":false,"image_ratio":"adapt","desktop_layout":"image_second","padding_top":16,"padding_bottom":16}},"1654834202bb05038b":{"type":"collapsible-content","blocks":{"1654834202ee17d84a-0":{"type":"collapsible_row","settings":{"heading":"Is there a limit to number of slots for each institution?","icon":"none","row_content":"<p>There are no limits on registration of teams. Teams are required to make payment to secure their slots. <\/p><p>As such, teams who register for 10 slots but can't make payment, won't have those slots reserved.<\/p>","page":""}},"1654834202ee17d84a-1":{"type":"collapsible_row","settings":{"heading":"How are slots allocated? Will it be on a first-come-first-serve basis?","icon":"none","row_content":"<p>Slots will be allocated on a first-come-first-served system, on the basis of payment made.<\/p><p>Payments should be made immediately upon registration or teams may choose to have an invoice sent to them where they have 7 days to make payment before their slots are dropped.<\/p>","page":""}},"1654834202ee17d84a-2":{"type":"collapsible_row","settings":{"heading":"The stated team cap is 120, is there a chance that this can be increased to accommodate more teams?","icon":"none","row_content":"<p>While the hotel has the capacity to accommodate more guests, we will only open up more slots if we are confident of having enough qualified judges down for the event.<\/p>","page":""}},"1654834202ee17d84a-3":{"type":"collapsible_row","settings":{"heading":"When does registration end or close?","icon":"none","row_content":"<p>Registrations close on 15 September. <\/p><p>Registrations and payments made after 15 September will not be accepted.<\/p>","page":""}},"e95eab9d-031b-46cf-9c7e-90cce32cbfca":{"type":"collapsible_row","settings":{"heading":"Can teams still register after the registration deadline?","icon":"none","row_content":"<p>After the registration deadline, the ticketing system for Asian BP will close.<\/p>","page":""}},"c358913c-3531-4852-ae28-72161169e33e":{"type":"collapsible_row","settings":{"heading":"Is there an option to register to participate virtually?","icon":"none","row_content":"<p>This event is not a virtual event. However, participants who will not be able to travel to the venue in person due to COVID restrictions will be entitled to a Good Will payout of (US$100). Such participants will still be eligible to attend the event virtually. <\/p><p>Participants who are unable to make it to the venue to to personal neglect, such as failing to comply with travel requirements, will not be eligible to the Good Will payout but can still attend the event virtually. <\/p>","page":""}},"515a4210-55b3-47f7-b884-f540923e65aa":{"type":"collapsible_row","settings":{"heading":"Is there an option to register with accommodation excluded?","icon":"none","row_content":"<p>There is no option to register with accommodation excluded. In order to minimize exposure to non-participants, ensure punctuality, and avoid logistical problems, all participants in ABP 2022 will be accommodated at the partner hotel. <\/p>","page":""}},"7f9e3e47-7a1e-45fb-a909-137c0d13ef24":{"type":"collapsible_row","settings":{"heading":"If I am applying for a scholarship offered by the event or council, do I register via the same registration channel?","icon":"none","row_content":"","page":""}},"f1008c4c-b289-4b8c-94c1-7eee564fc262":{"type":"collapsible_row","settings":{"heading":"What is the judge requirement policy of this event?","icon":"none","row_content":"<p>N-2<\/p>","page":""}},"29ca17db-49ff-4ab4-9d33-7107b1a1fd78":{"type":"collapsible_row","settings":{"heading":"If we registered and made payment for the judge requirement of this event, but the judge is unable to fly in to attend the event, must the judge still attend the event virtually?","icon":"none","row_content":"<p>This will be subject to Council's decision on the matter.<\/p>","page":""}}},"block_order":["1654834202ee17d84a-0","1654834202ee17d84a-1","1654834202ee17d84a-2","1654834202ee17d84a-3","e95eab9d-031b-46cf-9c7e-90cce32cbfca","c358913c-3531-4852-ae28-72161169e33e","515a4210-55b3-47f7-b884-f540923e65aa","7f9e3e47-7a1e-45fb-a909-137c0d13ef24","f1008c4c-b289-4b8c-94c1-7eee564fc262","29ca17db-49ff-4ab4-9d33-7107b1a1fd78"],"settings":{"caption":"","heading":"Registration","heading_size":"h2","heading_alignment":"left","layout":"none","color_scheme":"background-1","container_color_scheme":"background-2","open_first_collapsible_row":false,"image_ratio":"adapt","desktop_layout":"image_second","padding_top":40,"padding_bottom":16}},"1654835465c6967472":{"type":"collapsible-content","blocks":{"1654835465509a541b-0":{"type":"collapsible_row","settings":{"heading":"The registration fee stated is at 310 USD per person.   Krabi Asian BP (2017) charged ~290 USD per person for approximately the same features, what additional privileges should we expect for the additional 20 USD increment?","icon":"none","row_content":"","page":""}},"1654835465509a541b-1":{"type":"collapsible_row","settings":{"heading":"Must we pay immediately upon registration?","icon":"none","row_content":"<p>You may pay immediately upon registration. However, you will also have the option to request the issue of an invoice where you can pay up until seven days after the invoice is issued.<\/p>","page":""}},"1654835465509a541b-2":{"type":"collapsible_row","settings":{"heading":"What are the available payment options?","icon":"none","row_content":"<p>You can pay via Visa, Mastercard, and AmEx upon registration. If you choose to request for an invoice, you may also pay via WeChat.<\/p><p>Payment via bank transfer is not an available option. <\/p>","page":""}},"1654835465509a541b-3":{"type":"collapsible_row","settings":{"heading":"If our institution can only pay via Bank Transfer, will the event make an exception and allow us to pay via Bank Transfer?","icon":"none","row_content":"<p>Unfortunately, the event cannot make this exception. Should this situation arise, a participating member of the institution can opt to pay via the available payment options and request for reimbursement from their institution.<\/p>","page":""}},"5c9668b7-ac40-4954-9f90-41ef72477fcc":{"type":"collapsible_row","settings":{"heading":"If we selected the option for an issue of invoice, how much time will we have to make payment?","icon":"none","row_content":"<p>7 days.<\/p>","page":""}},"015a790b-fcf3-4180-82d1-d40365294e28":{"type":"collapsible_row","settings":{"heading":"What happens if we fail to make payment for the invoice within the given time?","icon":"none","row_content":"<p>Failure to make payment 7 days after the invoice is issued will void the slots requested. Should this happen, participants must again register their slots and pay within 7 days after the new invoice is issued or immediately upon registration.<\/p>","page":""}},"e2941d9e-d435-441b-a7c7-6f7496b9f2b6":{"type":"collapsible_row","settings":{"heading":"If our institution does not have the funds to participate in this tournament, will there be financial assistance?","icon":"none","row_content":"<p>Yes. The ABP 2022 council has an allocated scholarship budget. EduDrift has also committed to waiving the registration fees for 2 teams joining the tournament. <\/p><p>Eligibility criteria and application process for scholarships and subsidies will be released by the ABP 2022 council. <\/p>","page":""}},"b1e37406-e8b1-49bb-b798-48a2caeda46c":{"type":"collapsible_row","settings":{"heading":"If our institution does not have the funds to participate in this tournament, will there be a discounted option for participating virtually?","icon":"none","row_content":"<p>This event is designed to be an in-person event. Hence, there will be no option to participate virtually. Only participants who are able to provide official pre-departure travel curtailment documents due to Covid will be allowed to participate in the event virtually. <\/p>","page":""}},"d76972d9-b2d5-4230-8b22-d68a93ede078":{"type":"collapsible_row","settings":{"heading":"If we are unable to make it to the event due to travel restrictions, are we able to get a refund?","icon":"none","row_content":"<p>If you are unable to attend the event in person due to Covid and are able to present an official pre-departure travel curtailment document, you will be entitled to a Goodwill Payout of US$100 and still be eligible to participate in the event virtually.<\/p><p>For more information on cancellations and refunds, <a href=\"\/pages\/cancellation-app\" target=\"_blank\" title=\"Cancellation-app\">click here<\/a>.<\/p>","page":""}}},"block_order":["1654835465509a541b-0","1654835465509a541b-1","1654835465509a541b-2","1654835465509a541b-3","5c9668b7-ac40-4954-9f90-41ef72477fcc","015a790b-fcf3-4180-82d1-d40365294e28","e2941d9e-d435-441b-a7c7-6f7496b9f2b6","b1e37406-e8b1-49bb-b798-48a2caeda46c","d76972d9-b2d5-4230-8b22-d68a93ede078"],"settings":{"caption":"","heading":"Finance","heading_size":"h2","heading_alignment":"left","layout":"none","color_scheme":"background-1","container_color_scheme":"background-2","open_first_collapsible_row":false,"image_ratio":"adapt","desktop_layout":"image_second","padding_top":40,"padding_bottom":16}},"16548357540d509b50":{"type":"collapsible-content","blocks":{"16548357537b6dd0be-0":{"type":"collapsible_row","settings":{"heading":"Debate competitions are usually held in colleges with classrooms for the debates to take place. This event is expected to take place entirely in the hotel, how does that work?","icon":"none","row_content":"<p>Up to 25 hotel rooms will be retrofitted, redesigned, and utilized as debate rooms. The 36 sqm deluxe rooms will have their beds removed to fit tables and chairs required for the BP debate format.<\/p><p>This debate-in-hotel-room concept was pioneered by EduDrift and was executed in the 2017 edition of Asian BP in Krabi, and also in the 2019 edition of Australs in Bali.<\/p>","page":""}},"16548357537b6dd0be-1":{"type":"collapsible_row","settings":{"heading":"Is transportation required for commute between venues? How far is the convening hall from the hotel?","icon":"none","row_content":"<p>No. The convening hall and all debating venues will be held in the hotel's main building so all venues will only be a couple of steps or one elevator ride away from each other. <\/p>","page":""}},"16548357537b6dd0be-2":{"type":"collapsible_row","settings":{"heading":"Having hotel rooms converted into debate rooms seems like a logistical nightmare. Does the organisers have experience doing this and is there a contingency plan should this not be possible?","icon":"none","row_content":"<p>This debate-in-hotel-room concept was pioneered by EduDrift and was executed in the 2017 edition of Asian BP in Krabi, and also in the 2019 edition of Australs in Bali. Hence, you can be assured for sure that this will be possible for ABP 2022<\/p>","page":""}},"16548357537b6dd0be-3":{"type":"collapsible_row","settings":{"heading":"If a university or a school located in Bali is willing to offer venues for free, will the event consider having the venues at the school instead of the hotel?","icon":"none","row_content":"<p>No.<\/p>","page":""}},"c70cbc91-0964-46c3-8887-f612f808b242":{"type":"collapsible_row","settings":{"heading":"If all debates are to take place on the hotel premises, where should debaters go for their 15 minutes of preparation.","icon":"none","row_content":"<p>Debaters can prep anywhere within hotel premises.<\/p>","page":""}},"7e6290d0-a7c0-4e03-b993-83caa3ee683c":{"type":"collapsible_row","settings":{"heading":"Can debaters go to their own hotel rooms to prepare?","icon":"none","row_content":"<p>Yes.<\/p>","page":""}}},"block_order":["16548357537b6dd0be-0","16548357537b6dd0be-1","16548357537b6dd0be-2","16548357537b6dd0be-3","c70cbc91-0964-46c3-8887-f612f808b242","7e6290d0-a7c0-4e03-b993-83caa3ee683c"],"settings":{"caption":"","heading":"Venue","heading_size":"h2","heading_alignment":"left","layout":"none","color_scheme":"background-1","container_color_scheme":"background-2","open_first_collapsible_row":false,"image_ratio":"adapt","desktop_layout":"image_second","padding_top":40,"padding_bottom":16}},"1654836217a169cc48":{"type":"collapsible-content","blocks":{"1654836217ae4894c7-0":{"type":"collapsible_row","settings":{"heading":"In addition to Chief Adjudicators Vinodhan and Victoria, who else will be part of the Adjudication Core?","icon":"none","row_content":"<p>As per the constitution, all other members of the Adjudication Core will be voted in by the Asian BP Council of universities.<\/p>","page":""}},"1654836217ae4894c7-1":{"type":"collapsible_row","settings":{"heading":"Will a member of the Vietnam WUDC or Madrid WUDC Adjudication Core be joining the event as an Adjudication Core member?","icon":"none","row_content":"<p>Asian BP traditionally allows for the organisers to bring on a member of the Adjudication Core of the upcoming World Championships to the Asian BP Adjudication Core.<\/p><p>Given that this event takes place after Madrid WUDC, we will be looking to invite a member of the Vietnam WUDC team to this edition of the Asian BP.<\/p>","page":""}},"1654836217ae4894c7-2":{"type":"collapsible_row","settings":{"heading":"Since this event is prepared to welcome teams to connect virtually in the event that they are unable to attend, will you be open to having IA connecting virtually?","icon":"none","row_content":"<p>Opening up the IA pool to virtual judges will expand the quality of judges to include talents from Africa, Europe and Americas. The tradeoff, however, is the reliability of these judges in connectivity and punctuality during the event. <\/p><p>The Adjudication Core will make a decision on this matter when they open up the applications for invited adjudicators (IA).<\/p>","page":""}},"1654836217ae4894c7-3":{"type":"collapsible_row","settings":{"heading":"This event has confirmed experienced debate specialists as advisors. Are these advisors confirmed as judges?","icon":"none","row_content":"<p>Yes. These judges have given their commitment to judge the preliminary rounds of ABP 2022 in person. <\/p>","page":""}},"4422f867-189a-45ec-bcc2-3df700e4f45e":{"type":"collapsible_row","settings":{"heading":"With the experienced Advisors in the mix, the adjudication pool will be highly competitive and inadvertently affecting the breaks for institutional judges attending the event.  Does this mean that our institutional judges are unlikely to break at the tournament?","icon":"none","row_content":"","page":""}},"68687778-76bc-4b12-880f-61032c400f29":{"type":"collapsible_row","settings":{"heading":"Based on an 80 team turnout, how much adjudication subsidy is available for Independent\/Invited Adjudicators?","icon":"none","row_content":"","page":""}}},"block_order":["1654836217ae4894c7-0","1654836217ae4894c7-1","1654836217ae4894c7-2","1654836217ae4894c7-3","4422f867-189a-45ec-bcc2-3df700e4f45e","68687778-76bc-4b12-880f-61032c400f29"],"settings":{"caption":"","heading":"Adjudication","heading_size":"h2","heading_alignment":"left","layout":"none","color_scheme":"background-1","container_color_scheme":"background-2","open_first_collapsible_row":false,"image_ratio":"adapt","desktop_layout":"image_second","padding_top":36,"padding_bottom":36}},"165492002944cd7365":{"type":"rich-text","blocks":{"1654920029c6517d1e-0":{"type":"heading","disabled":true,"settings":{"heading":"Talk about your brand","heading_size":"h1"}},"1654920029c6517d1e-1":{"type":"text","settings":{"text":"<p>Have more questions to ask?<\/p>"}},"1654920029c6517d1e-2":{"type":"button","settings":{"button_label":"Ask here","button_link":"https:\/\/edudrift.typeform.com\/to\/KkSwxrN4","button_style_secondary":false}}},"block_order":["1654920029c6517d1e-0","1654920029c6517d1e-1","1654920029c6517d1e-2"],"settings":{"color_scheme":"background-1","full_width":true,"padding_top":0,"padding_bottom":52}}},"order":["main","1654829481a6132a9e","165482952999a06e00","1654834202bb05038b","1654835465c6967472","16548357540d509b50","1654836217a169cc48","165492002944cd7365"]}