{"sections":{"main":{"type":"main-page","disabled":true,"settings":{"padding_top":28,"padding_bottom":28}},"165474769867a0bf87":{"type":"rich-text","blocks":{"1654747698a7031f23-0":{"type":"heading","settings":{"heading":"CANCELLATION POLICY","heading_size":"h1"}}},"block_order":["1654747698a7031f23-0"],"settings":{"color_scheme":"background-1","full_width":false,"padding_top":40,"padding_bottom":40}},"16547517641c74fbf4":{"type":"multicolumn","blocks":{"1654751764c9049de5-0":{"type":"column","settings":{"title":"","text":"<p><strong>Pre-departure Travel Curtailment due to COVID-19<\/strong><\/p><p>If participants are unable to attend the event due to COVID restrictions, they will still be able to take part in the event virtually. <\/p><p><br\/>In such instances, a Goodwill Payout of US$100 be made to the participant. Payout amount will be subject to bank charges and applicable processing fees to the original mode of payment. <\/p><p><br\/>Goodwill Payout will only be made to participants who are unable to travel and attend the event in-person due to COVID policies beyond their control. Proof of travel curtailment includes official PCR\/ART test report, government-issued travel advisory and\/or restriction, university-issued travel restriction, city or country lockdown notice, and mandatory quarantine notice. Travel disruptions arising from personal negligence such as failure to comply with COVID-19 travel requirements will not be entitled to the Goodwill Payout.<\/p><p><strong><br\/>Cancellation:<\/strong><br\/>Tickets once purchased are not refundable. <\/p><p><strong><br\/>No show: <\/strong><\/p><p>Tickets once purchased are not refundable. <\/p><p><strong><br\/>No Change:<\/strong><\/p><p>This tickets allow admission to only this event. Tickets to this event is non-transferrable.<\/p><p><strong><br\/>Force Majeur<\/strong><\/p><p>In the event that Asian BP cannot be held due to reasons beyond the control of the organisers, the event will transit to a 100% online event.<\/p><p><br\/>In such instance, a Goodwill Payout of US$100 be made to every participant. Payout amount will be subject to bank charges and applicable processing fees to the original mode of payment. <\/p><p><strong><br\/>Disclaimer:<\/strong><\/p><p>Rights of admission are reserved with the organizer.<\/p><p>The organiser reserves the right to alter the schedule of the event without prior notice<\/p><p>The event is subject to force majeure conditions.<\/p><p>In order to maintain high quality of user experience, EduDrift may collect certain information (including but not limited to personally identifiable information) from you such as name, e-mail address or telephone number at the time of booking\/registration\/payment. By agreeing to participate in the event, you hereby give your consent to EduDrift to collect, receive, possess, store, deal and handle all information as provided herein for its own purposes.<\/p><p>&gt; EduDrift does not assume any responsibility with regards to any injury or complications due to COVID – 19 accrued as a result of your participation.<\/p>","link_label":"","link":""}},"1654751764c9049de5-1":{"type":"column","disabled":true,"settings":{"title":"Column","text":"<p>Pair text with an image to focus on your chosen product, collection, or blog post. Add details on availability, style, or even provide a review.<\/p>","link_label":"","link":""}},"1654751764c9049de5-2":{"type":"column","disabled":true,"settings":{"title":"Column","text":"<p>Pair text with an image to focus on your chosen product, collection, or blog post. Add details on availability, style, or even provide a review.<\/p>","link_label":"","link":""}}},"block_order":["1654751764c9049de5-0","1654751764c9049de5-1","1654751764c9049de5-2"],"settings":{"title":"","heading_size":"h0","image_width":"full","image_ratio":"adapt","columns_desktop":1,"column_alignment":"left","background_style":"none","button_label":"","button_link":"","color_scheme":"background-1","columns_mobile":"1","swipe_on_mobile":false,"padding_top":0,"padding_bottom":36}}},"order":["main","165474769867a0bf87","16547517641c74fbf4"]}