{"sections":{"main":{"type":"main-page","disabled":true,"settings":{"padding_top":28,"padding_bottom":28}},"1654160957ac360e7d":{"type":"rich-text","blocks":{"165416095749d6fad6-0":{"type":"heading","settings":{"heading":"TAB and Digital Consultants","heading_size":"h1"}},"5cdf0bfb-aa81-44f2-ae17-15f04d997cfb":{"type":"text","settings":{"text":"<p><br\/>Asian BP 2022 will be running on tabulation software TabbyCat and deployed onto CalicoTab for ease of access. On the tab site, participants will be able to access their matchups, view their results and verify their participation information during the event. The tab site will also allow participants to submit feedback.<\/p><p><br\/>This event will use Slack as the main communication channel for information dissemination to all registered participants. Zoom Meetings being used as the debate venue for registered teams who are unable to be physically present, to connect in. The digital team will also be in charge of livestream and broadcasting.<\/p><p><br\/><\/p>"}}},"block_order":["165416095749d6fad6-0","5cdf0bfb-aa81-44f2-ae17-15f04d997cfb"],"settings":{"color_scheme":"background-1","full_width":true,"padding_top":20,"padding_bottom":20}},"1654576501b225df0b":{"type":"multicolumn","blocks":{"1654576501f8534ed1-0":{"type":"column","settings":{"image":"shopify:\/\/shop_images\/Andree_Chandra.png","title":"About","text":"<p>Andree is a digital consultant to Indonesia's national-level debate competition for both the varsity and school level. The Ministry of Education governed competitions are held in the various formats and are conducted in both the English language and the national language Bahasa Indonesia.<\/p><p><br\/>In the debate community, Andree is known as an event consultant for educational events in the region. He frequently employs data science and his spreadsheet enthusiasm when taking on the role of tab director. Andree is currently serving as an analyst for one of Indonesia's leading channel-neutral communications consultancy firms.<\/p><p><br\/>Andree has managed and served on the tabulation teams of several regional championships. Some notable ones include UADC 2018, Asian BP 2019, Australs 2019 and 2020.  <\/p>","link_label":"","link":""}},"1654576501f8534ed1-1":{"type":"column","settings":{"image":"shopify:\/\/shop_images\/VAT.png","title":"About","text":"<p>Vu Ahn Tuan, more affectionately known in the community as V.A.T, regards debating as more than just a passion. As Vietnam's most accomplished debate veteran, he goes about Vietnam with projects aimed to increase accessibility of students to the craft of debate and public speaking in the English language.<\/p><p><br\/>Trained in tabulation and event organisational work, V.A.T. is best known for his extensive experience of transitioning tournaments online in the COVID world. From Worlds, Austals to both formats of the Asian Championships, V.A.T. has supported close to a hundred tournaments in the capacity of the digital director. <\/p><p><br\/>With this edition of Asian BP expecting some teams that may be forced to connect in virtually due to travel restrictions, V.A.T. will help to advise and ensure a smooth hybrid version of the event when that need arises.<\/p>","link_label":"","link":""}}},"block_order":["1654576501f8534ed1-0","1654576501f8534ed1-1"],"settings":{"title":"","heading_size":"h1","image_width":"full","image_ratio":"adapt","columns_desktop":2,"column_alignment":"left","background_style":"none","button_label":"","button_link":"","color_scheme":"background-1","columns_mobile":"1","swipe_on_mobile":true,"padding_top":36,"padding_bottom":36}}},"order":["main","1654160957ac360e7d","1654576501b225df0b"]}